<template>
    <div class="solicit">
        <header>
            <img src="../../static/img/solicit/Bitmap2.png">
        </header>

        <section>
            <div class="contain">
                <h1>主题介绍</h1>

                <p>新站新气象，为了鼓励更多的喜爱文字创作的朋友讲出心中的故事，也为了让我们辣鸡这个“小世界”的故事更加的丰富多彩，现在我们向全网征集优秀的原创故事！</p>
                <p>勇敢的少年，快来创造奇迹！</p>

                <h1>征集范围</h1>

                <p class="title">幻想都市篇</p>

                <p>平行都市系列</p>
                <p class="text">
                    茫茫宇宙，浩瀚星空。
                    你可曾想过，当你偶然穿越到另一个平行世界时，会有着怎样精彩的奇遇？
                    或许你重生90年代的日本，摇身变成了漫画家，与富坚义博，青山刚昌，尾田荣一郎，用热销作品一决高下？
                    或许你重生80年代的美国，摇身变成了资本家，拳打微软，脚踏苹果，干掉了漫威，创办了英伟达？
                    又或许你重生今日天朝，摇身变成女装大佬，萝莉主播，哼，管你什么吃鸡王？什么百强王者？什么第一歌姬，统统不在本主播话下！
                    平行世界，想象无限！
                    你可以是剑道大师，一代厨神，宠物医生，小说作家，也可以是阴阳寮里的阴阳师，娱乐圈内的大明星！
                    只要你有足够的想象，可以在那个平行世界里书写任何你想写下的故事！
                </p>
                <p class="text">例文：《变身之萝莉主播》《变身透视校花》《大牧场主》《我在东瀛画工口本子》《我在日本当轻小说大师》《东京影姬》《女装大佬》</p>

                <p>恐怖都市系列！</p>
                <p class="text">
                    你可知道，平静如水的城市下，也会有着暗流涌动？
                    罪犯，妖物，恶鬼，亡灵......这些被人们视为怪异的存在，隐藏在都市的各个角落。
                    可能你刚刚租下的房子，是伽椰子的凶宅。
                    也或许你打开电视，里面爬出来的是贞子。
                    又或者你夜晚路过的水潭，楚人美正一袭蓝衣，背对着你......
                    城市边缘，大雾弥漫。
                    一个叫做寂静岭的小镇，即将面临拆迁。
                    商业巨头，保护伞公司的新药已经研发出来，
                    正在商业中心醒目的广告牌上，找人做最新的临床实验......
                    而这个时候，身为主角的你，又在哪里？
                    是带着系统，开启无双，把一切妖魔鬼怪打成碎片？
                    还是搜集阴气，穿梭各个恐怖事件之中，寻找真相，解开一切谜团？
                </p>
                <p class="text">例文：《这个世界有问题》《重生日本的我，在灵异剧里开无双》《无限恐怖》《反正我是超能力者》</p>

                <p>日常都市（宅男YY向）系列</p>
                <p class="text">
                    “粑比，粑比！”
                    你可曾想过，当身为宅男的你清晨睁开睡眼，突然看见一个精致可爱的女儿，管自己叫爸爸？
                    当你下班归来，突然发现自己前世的老婆，竟然变成了仙女，特意下凡为你持家？
                    又或者当你作为老师第一天上班，却发现原本班级里的乖乖女生，竟然背地里有着各种各样的问题？
                    日常生活中，身为男主角的我们，身边或多或少都会有些熟悉的女性角色存在。
                    但如果有一天，我们把身边的这些女角色性格改变，把原本平淡的生活变得搞笑，逗比起来，届时又会有着怎样精彩的事件发生呢？
                    弟控姐姐，兄控妹妹，病娇老婆，高冷女友，问题女学生......
                    当这些改变了性格，身份的女角色，离不开我们，再次融入到我们身边的普通生活时，你又会在脑中迸发出怎样有意思的剧情？
                    所以诸君，请发挥自己的想象，写出你脑中以衰弱宅男为视角的日常幻想吧！
                </p>
                <p class="text">例文：《前世老婆找上门》《我为女儿O一秒》《日本女校的男保健老师》《我的妹妹是coser?》《我的女友是龙傲天》 《我的老婆是个宅》</p>

                <p>超现实都市系列</p>
                <p class="text">
                    精灵之家？巫师协会？怪兽军团？吸血鬼？
                    异能管理局？外星人研究中心？茅山道术职业技术学院？
                    生活之中，肯定会有许许多多超乎现实，只存在于想象中的事件发生。
                    车水马龙的繁华都市中，有清风仙人御剑飞行，传统校园里，嫦娥仙子一本正经传授上古炼丹术，女仆餐厅内，七仙女制服亮相，可爱激萌......
                    或许，在现实都市的另一面，还有着一个魔幻都市悄悄隐藏，不为人知。
                    又或许，在千百年后，人类文明发展到极致，可以横渡宇宙，驾驶星河舰队，成为至高主宰般的存在。
                    那么现在，请用你的笔，发挥你的想象，将你心中的这个世界勾勒出来吧。
                </p>
                <p class="text">例文：《少女航线》，《我妖重新做人》，《神盾局的新晋职员》，《混在漫威当剑仙》  ，《仙王的日常生活》，《我修的可能是假仙》</p>

                
                <p class="title">幻想异界篇</p>

                <p>异界店铺系列</p>
                <p class="text">
                    “兽人永不为奴！除......除非吃的管够！”  
                    异界大陆中，也许依靠武力并不能征服所有种族，但，美食可以！
                    一名厨师，一家餐厅。
                    在这里，你可以吃到各种各样的异界美食。
                    用黄金鸟蛋做出的蛋炒饭，用生命之泉酿造出的烈酒，还有清蒸刺须鲶鱼，炭烧寒地野兔......
                    嗝！
                    当然，吃饱饭后，你也可以去旁边的异界杂货铺看看，那也是我开的。
                    里面应有尽有，各个次元，各个位面，只要你想得到的，哪怕是天上的星星，我也可以摘下来售卖！
                </p>
                <p class="text">例文：《奶爸的异界餐厅》，《佛系恶魔的小卖部》，《异世界的美食家》，《异界食谱》</p>

                <p>异界变身系列</p>
                <p class="text">
                    你是否想过，当有一天醒来，自己竟然变成了一头巨龙？
                    破碎的蛋壳，纷乱的异界。
                    而带着人类灵魂的你，又将在这个世界里，有着怎样不同的人生？       
                    当然，你也可以选择其他族类，不死鸟，皮皮虾，蓝精灵......
                    各种各样的种族，精彩纷纭的经历，请大胆发挥你的想象，把你想写的人生，用手中的笔描绘出来！
                </p>
                <p class="text">例文：《霜寒之翼》《我，旧日支配者》《红龙》《贪吃蛇的目标是吞噬星空》</p>

                <p>异界历史系列</p>
                <p class="text">
                    你是否想过，有一天，你可以穿越回过去，改变历史的轨迹？
                    在繁华的大唐盛世，开办淘宝，创建滴滴？
                    在落寞的明朝末期，驾驶无敌舰队，远渡重洋，称霸海洋世纪？
                    又或者，你可以凭空想象出一段历史，描绘出一个新的世界观，开展另一段属于主角的英雄传奇？    
                    还是你可以穿梭过去，作为一名历史的见证者，看那花开花落，云卷云舒，新旧史诗的交替？
                </p>
                <p class="text">例文：《我的大宝剑》《我可能活得有点久了》《他，改变了大唐》《大明：征服天堂》</p>

                <p>异界次元系列</p>
                <p class="text">
                    热血日漫世界，战斗游戏世界，日系轻小说世界。
                    间桐雁夜，舰娘俾斯麦，时崎狂三......   
                    浩如烟海的位面世界，个性鲜明的人物形象，总能发现一个专属于你的幻想次元！   
                    那么现在，请将你脑中的次元世界诉诸笔端！
                    无论是型月世界，还是各种日系综漫快穿，只要你敢把你心中的幻想写下，我们就敢来看！ 
                </p>
                <p class="text">例文：《轮回乐园》《我，型月，漫画家》《型月的根源人偶师》《将我的节操作为祭品献上》《次元论坛》《无限绅士》《无限世界的套路基本法》</p>


                <p class="title">幻想次元篇</p>

                <p>同人系列</p>
                <p class="text">
                    青春畅想，热血日漫！
                    战火连天，激情四燃！
                    木叶高傲的苍蓝猛兽，阿凯老师曾经说过，青春的勋章离不开热血！当新叶萌发，新春到来之时，才是青春的最高潮燃烧得最火热的时刻！
                    没错！
                    我们每个人都有青春，而青春的三大精神，就是激情，奋斗与力量！
                    所以少年郎，请尽情挥洒你自己的想象吧！
                    你可以将你笔下的主角，融入那些曾经让你热血沸腾的战斗日漫中，与鸣人，佐助一起在竞争中成长，与路飞起航扬帆，寻找海贼王罗杰的宝藏！
                </p>
                <p class="text">例文：《火影之最强震遁》，《海贼之火龙咆哮》，《龙珠之武天宗师》，《神级剑魂系统》，《一拳之最强英雄》，《名侦探世界里的巫师》</p>


                <p class="title">腐女的幻想世界篇</p>

                <p>ABO系列</p>
                <p class="text">
                    人类在未来被分为六种性别，占据统治与领导地位的ALPHA男、ALPHA女，占人口绝大多数的BETA男、BETA女，以及高受孕率的OMEGA男、OMEGA女。不甘心受性别的桎梏，小心翼翼地隐瞒身份，克服生理缺陷，最终是否能够成功打破偏见达成最初的理想？
                </p>
                <p class="text">例文：《军校生》、《帝国模范婚姻》、《银河帝国之刃》、《破晓》</p>

                <p>哨向系列</p>
                <p class="text">
                    觉醒为哨兵拥有强大战斗力的同时，不安定的精神狂躁随时可能摧毁一位失控的哨兵；向导的精神输导是少数有效平复哨兵情绪的方式。灵魂契合的哨兵与向导结合，将最大化发挥出两者的实力。
                </p>
                <p class="text">例文：《断点续传》、《全职军医》、《逆袭[星际]》</p>

                <p>人鱼系列</p>
                <p class="text">
                    星际环境的辐射性射线下的人类女性濒临灭绝，而雌雄同体的深海人鱼基因却能够改造人体，使其拥有生育能力。男性公民积攒半生的贡献值，只为换取一条可以共度一生的人鱼。
                </p>
                <p class="text">例文：《总有人鱼爱跟我抢男人[星际]》、《人鱼的悲催生活》</p>

                <p>兽人系列</p>
                <p class="text">
                    这里的男性被分为兽人与亚兽，拥有在兽态与人身转变能力的被称为兽人，而只能保持人身的男性被称作亚兽。
                </p>
                <p class="text">例文：《兽丛之刀》</p>

                <p>哥儿爷们系列</p>
                <p class="text">
                    这个世界的男性被分为爷们和哥儿，高大的爷们承担大部分的体力活，相对较瘦弱的哥儿，眼边泪痣颜色越是鲜艳，则生育能力越强，越受到欢迎。
                </p>
                <p class="text">例文：《我不要生小孩儿》</p>


                <h1>作品要求</h1>

                <p>1.深脑洞，欢乐向，疯吐槽，梗玩年！</p>
                <p class="text">
                    本次征文作品不限定任何背景，任何题材，但上述四大元素，行文风格之中，至少满足其中两点，否则将无法正常参与评奖。
                </p>
                <p class="text">
                    参与时，在辣鸡后台或app新建作品时勾选【辣鸡开站征文辣！】相应征文主题即可参赛。
                </p>
                <p>2.原创作品，且作者拥有全部版权，预计篇幅超过百万字的长篇小说。</p>
                <p>3.作品必须内容积极向上，不得违反国家政策法规，不得抄袭复制，不得涉政涉黄涉黑，不得侮辱民族宗教信仰极其生活习俗，违者取消资格并承担相应后果。</p>


                <h1>作品奖励</h1>
                
                <p>1.全勤调整为：日更3000字奖励600元，一个月最多可使用3次请假卡。</p>
                <p>2.获得网站的优先推广、推荐的权利。</p>
                <p>3.获得有声小说、漫画、出版、影视的优先推荐权。</p>

                <h1>参加流程</h1>

                <p>作品需要先签约辣鸡小说，然后由责编来进行评选，符合征文要求即可享受征文奖励。</p>
            </div>

            <div class="nav">
                <img src="../assets/image/icon/creation-icon.png" alt="">
                <h1 :class="{active: 817.272705078125 <= screenHeight && screenHeight < 1090}" @click="jump(817.272705078125)">主题介绍</h1>
                <h1 :class="{active: 1090 <= screenHeight && screenHeight < 4290.9091796875}" @click="jump(1090)">征集范围</h1>
                <p :class="{active: 1090 <= screenHeight && screenHeight < 2536}" @click="jump(1090)">幻想都市篇</p>
                <p :class="{active: 2536 <= screenHeight && screenHeight < 3545.45458984375}" @click="jump(2545.45458984375)">幻想异界篇</p>
                <p :class="{active: 3545.45458984375 <= screenHeight && screenHeight < 3909.0908203125}" @click="jump(3545.45458984375)">幻想次元篇</p>
                <p :class="{active: 3909.0908203125 <= screenHeight && screenHeight < 4290.9091796875}" @click="jump(3909.0908203125)">腐女的幻想世界篇</p>
                <h1 :class="{active: screenHeight >= 4290.9091796875}" @click="jump(4290.9091796875)">作品要求</h1>
                <h1 @click="jump(4290.9091796875)">作品奖励</h1>
                <h1 @click="jump(4290.9091796875)">参加流程</h1>
            </div>
        </section>
    </div>
</template>

<script>
export default {

    data() {
        return {
            screenHeight: 0,
        }
    },

    mounted() {
        window.addEventListener('scroll', this.menu)
    },

    methods: {
        menu() {
            this.screenHeight = document.documentElement.scrollTop || document.body.scrollTop;
        },

        jump(val) {
            document.documentElement.scrollTop = val
        }
    }

}
</script>

<style lang="stylus" type="text/stylus" rel="stylesheet/stylus">
.solicit
    width 100%
    header
        width 100%
        img
            width 100%
    section
        width 100%
        min-width 1024px
        background linear-gradient(to bottom, #A5D9F7, #fff)
        .contain
            padding 30px 0 100px 0
            width 50%
            margin 0 auto
            h1
                margin-bottom 30px
                text-align center
                font-size 28px
            h2
                margin 20px 0
            
            p
                margin 20px 0
                font-size 16px
            p.title
                font-size 32px
                text-align center
            p.text
                margin 0 20px
                line-height 40px
        .nav
            position fixed
            right 18%
            margin-right -77px
            bottom 10%
            padding 15px 0
            width 155px
            border-radius 10px
            text-align center
            background #fff
            img
                position absolute
                top -54px
                left 50%
                transform translateX(-50%)
            h1, p
                cursor pointer
                height 25px
                line-height 25px
            .active
                display block
                box-shadow none
                background #fff0ac
                color #fb5e6f
</style>
